#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
workos_organization.google: Refreshing state... [id=org_01GPYADZCQ1ZM69W43C52D7DV9]
workos_organization.amazon: Refreshing state... [id=org_01GPY9TKDTQ5EWMXXAB4M6XMHG]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # workos_organization.amazon will be destroyed
  # (because workos_organization.amazon is not in configuration)
  - resource "workos_organization" "amazon" {
      - allow_profiles_outside_organization = false -> null
      - created_at                          = "2023-01-16T22:05:03.801Z" -> null
      - domains                             = [
          - "amazon.com",
          - "amazon.de",
        ] -> null
      - id                                  = "org_01GPY9TKDTQ5EWMXXAB4M6XMHG" -> null
      - name                                = "Amazon" -> null
      - updated_at                          = "2023-01-16T22:05:03.801Z" -> null
    }

  # workos_organization.google will be updated in-place
  ~ resource "workos_organization" "google" {
      ~ allow_profiles_outside_organization = false -> (known after apply)
      ~ domains                             = [
          - "google.com",
          + "google.fr",
            "google.com.ua",
        ]
        id                                  = "org_01GPYADZCQ1ZM69W43C52D7DV9"
        name                                = "Google"
      ~ updated_at                          = "2023-01-16T22:15:38.646Z" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # workos_organization.netflix will be created
  + resource "workos_organization" "netflix" {
      + allow_profiles_outside_organization = (known after apply)
      + created_at                          = (known after apply)
      + domains                             = [
          + "netflix.com",
        ]
      + id                                  = (known after apply)
      + name                                = "Netflix"
      + updated_at                          = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Vellanci, Action: `pull_request`, Working Directory: ``, Workflow: `pr-flow`*